refume/app/controllers/matches_controller.rb

  def create
    @match = Match.new(match_params)

    respond_to do |format|
      if @match.save
---
INSERT INTO "matches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-02-18 08:21:02.747110"], ["updated_at", "2020-02-18 08:21:02.747110"]]

    def set_match
      @match = Match.find(params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]