refume/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."mentee_id" = ?  [["mentee_id", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."mentor_id" = ?  [["mentor_id", 4]]
---
  def show
    #find_by method automatically does the sanity check on user input
    #to prevent SQL injection
    #@user = User.find(params[:id])
    @user = User.find_by_id(params[:id])
    #get all the matched mentors/mentees for this user
    @matches = nil
    if @user.role == "Mentee"
      @matches = Match.where(mentee_id: @user.id)
    elsif @user.role == "Mentor"
      @matches = Match.where(mentor_id: @user.id)

INSERT INTO "users" ("name", "email", "age", "zipcode", "country", "goals", "created_at", "updated_at", "password_digest", "language", "bio", "activation_digest", "role") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "age" = ?, "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 22], ["bio", ""], ["updated_at", "2020-02-13 22:14:20.503265"], ["id", 7]]
---
  def update
    @user = User.find_by_id(params[:id])
    if @user.update_attributes(user_params)